Autodesk.Revit.DB.RevitLinkInstance.MoveOriginToHostOrigin(System.Boolean)
Moves this link instance so that the internal origin
of the linked document is aligned to the internal origin
of the host document. This is a one-time movement and does not
set up any shared coordinates relationship.
If the rotation angle of the link instance was changed after insertion,
the rotation angle can be preserved or reset to the original insertion angle.
Remarks:
This operation can only be performed on instances of top-level links.
The internal origin is not necessarily the same location as the Project
Base Point. See Autodesk.Revit.DB.RevitLinkInstance.MoveBasePointToHostBasePoint(System.Boolean).
resetToOriginalRotation:
Sets to true if:
restoring the original insertion angle of the link instance after it is moved
if there was a rotation \ mirror transform on the link instance.
there was no a rotation \ mirror transform on the link instance.
Sets to false to retain the current angle of the link instance after it is moved
if there was a rotation \ mirror transform on the link instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkInstance is not an instance of a loaded RevitLinkType.
-or-
This RevitLinkInstance is not an instance of a top-level RevitLinkType.
-or-
The operation is not permitted because the element is pinned.
Since:
2016 SubscriptionUpdate

Autodesk.Revit.DB.RevitLinkInstance.MoveBasePointToHostBasePoint(System.Boolean)
Moves this link instance so that the base point in
the linked document is aligned to the base point in the
host document. This is a one-time movement and does not
set up any shared coordinates relationship.
If the rotation angle of this link instance was changed after insertion,
the rotation angle can be preserved or reset to the original insertion angle.
Remarks:
The link must be loaded for Revit to find the location of the link's base point.
This operation can only be performed on instances of top-level links.
resetToOriginalRotation:
Sets to true if:
restoring the original insertion angle of the link instance after it is moved
if there was a rotation \ mirror transform on the link instance.
there was no a rotation \ mirror transform on the link instance.
Sets to false to retain the current angle of the link instance after it is moved
if there was a rotation \ mirror transform on the link instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkInstance is not an instance of a loaded RevitLinkType.
-or-
This RevitLinkInstance is not an instance of a top-level RevitLinkType.
-or-
The operation is not permitted because the element is pinned.
Since:
2016 SubscriptionUpdate

Autodesk.Revit.DB.RevitLinkInstance.GetLinkDocument
The document associated with the Revit link.
Remarks:
Operations that require a transaction or modify the document's status in memory (such as Save and Close) cannot be performed on this document.
Since:
2014

Autodesk.Revit.DB.RevitLinkInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ImportPlacement)
Creates a new instance of a linked Revit project (RevitLinkType).
Remarks:
Instances will be placed origin-to-origin or by shared coordinates.
This function cannot be used to create instances
of nested links.
document:
The document in which the new instance should be created.
revitLinkTypeId:
The element id of the RevitLinkType.
placement:
The mode where to place the RevitLinkInstance.
Set this option to place the view at the origin or by shared coordinates.
Returns:
The newly-created RevitLinkInstance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revitLinkTypeId isn't a RevitLinkType.
-or-
revitLinkTypeId is not a top-level link.
-or-
revitLinkTypeId is not a loaded RevitLinkType
-or-
document is not a project document.
-or-
placement isn't supported.Only Origin or Shared placement is supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The placement is Shared, and the host model and the link do not share the same coordinate system.
Or the placement is Shared, and the shared coordinates of the host model do not match the GIS coordinate system of the linked file.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.RevitLinkInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new instance of a linked Revit project (RevitLinkType).
Remarks:
Instances will be placed origin-to-origin.
This function cannot be used to create instances
of nested links.
document:
The document in which the new instance should be created.
revitLinkTypeId:
The element id of the RevitLinkType.
Returns:
The newly-created RevitLinkInstance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revitLinkTypeId isn't a RevitLinkType.
-or-
revitLinkTypeId is not a top-level link.
-or-
revitLinkTypeId is not a loaded RevitLinkType
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.RevitLinkInstance
Represents an instance of a RevitLinkType.
Since:
2013